<?php
//1

/*
 * Сформируйте с помощью двух вложенных циклов следующий массив:

[[1, 2, 3, 4, 5], [1, 2, 3, 4, 5],
	[1, 2, 3, 4, 5]]
 */

$arr=[];
for ($i=0;$i<3;$i++){
    for ($j=1;$j<=5;$j++){
        $arr[$i][$j]=$j;
    }
}
var_dump($arr);

//2
/*
 * Сформируйте с помощью двух вложенных циклов следующий массив:

[['x', 'x', 'x', 'x'], ['x', 'x',
	'x', 'x'], ['x', 'x', 'x', 'x']]
 */
$arr=[];
for ($i=0;$i<3;$i++){
    for ($j=1;$j<=3;$j++){
        $arr[$i][$j]="x";
    }
}
var_dump($arr);

//3
/*
 * Сформируйте с помощью трех вложенных циклов следующий массив:

[
	[
		[1, 2, 3, 4, 5],
		[1, 2, 3, 4, 5],
	],
	[
		[1, 2, 3, 4, 5],
		[1, 2, 3, 4, 5],
	],
	[
		[1, 2, 3, 4, 5],
		[1, 2, 3, 4, 5],
	],
]
 */

$arr=[];
for ($i=0;$i<=2;$i++){
    for ($j=0;$j<2;$j++){
        for ($k=1;$k<=5;$k++){
            $arr[$i][$j][$k]=$k;
        }
    }
}
var_dump($arr);
//4
/*
 * Сформируйте с помощью двух вложенных циклов следующий массив:

<?php
	[[1, 2], [3, 4], [5, 6], [7, 8]]
?>
 */
$arr=[];
for ($i=0,$k=1;$i<=3;$i++){
    for ($j=0;$j<=1;$j++,$k++){
        $arr[$i][$j]=$k;
    }
}
var_dump($arr);

//5
/*
 * \Сформируйте с помощью двух вложенных циклов следующий массив:

<?php
	[[2, 4, 6], [8, 10, 12], [14,
		16, 18], [20, 22, 24]]
?>
 */

$arr=[];
for ($i=0,$k=2;$i<=3;$i++){
    for ($j=0;$j<=2;$j++,$k=$k+2){
        $arr[$i][$j]=$k;
    }
}
var_dump($arr);

//6
/*
 * Сформируйте с помощью трех вложенных циклов следующий трехмерный массив:

<?php
	[[[1, 2], [3, 4]], [[5, 6], [7,
		8]]]
?>
 */
$arr=[];
for ($i=0,$k=0;$i<=3;$i++){
    for ($j=0;$j<2;$j++,$k++){
        $arr[0][$i][$j]=$k;
    }
}
var_dump($arr);